/* Non-user-facing error text for a connection that has been closed due to a timeout. */
"GCDAsyncSocketClosedError" = "Разъём закрыт удаленным партнером.";

/* Non-user-facing error text for an attempted connection that has failed due to a timeout. */
"GCDAsyncSocketConnectTimeoutError" = "Истекло время попытки подключения к узлу.";

/* No comment provided by engineer. */
"GCDAsyncSocketOtherError" = "Попытка создать сокет из сокета FD не удалась. getpeername() не удалась.";

/* Non-user-facing error text for a read operation that has read the maximum amount of allowed data. */
"GCDAsyncSocketReadMaxedOutError" = "Операция чтения достигла установленной максимальной длины";

/* Non-user-facing error text for a read operation that has failed due to a timeout. */
"GCDAsyncSocketReadTimeoutError" = "Истекло время для операции чтения";

/* Non-user-facing error text for a write operation that has failed due to a timeout. */
"GCDAsyncSocketWriteTimeoutError" = "Истекло время для операции записи";

